<a href="https://colab.research.google.com/github/syh0397/codestates-AI-bootcamp-1/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#VGames2.csv Data Analysis

# **1 . 기본 패키지불러오기**

In [68]:
#라이브러리 불러오기 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#글꼴설치
!sudo apt-get install -y fonts-nanum
!sudo fc-cache -fv
!rm ~/.cache/matplotlib -rf

Reading package lists... Done
Building dependency tree
Reading state information... Done
The following NEW packages will be installed:
  fonts-nanum
0 upgraded, 1 newly installed, 0 to remove and 12 not upgraded.
Need to get 9,604 kB of archives.
After this operation, 29.5 MB of additional disk space will be used.
Get:1 http://archive.ubuntu.com/ubuntu bionic/universe amd64 fonts-nanum all 20170925-1 [9,604 kB]
Fetched 9,604 kB in 1s (6,800 kB/s)
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 1.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package fonts-nanum.
(Reading database ... 146364 files and directories currently installed.)
Preparing to unpack .../fonts-nanum_20170925-1_all.deb ...
Unpacking fonts-nanum (20170925-1) ...
Setting up fonts-nanum (20170925-1) ...
Processing triggers for fontconfig (2.12.6-0ubuntu2) ...
/usr/share/fonts: caching, new cache contents: 0 fonts, 1 dirs
/usr/share/fonts/truetype: caching, new cache contents: 0 fonts, 3 dirs
/usr/share/fonts/truetype/humor-sans: caching, new cache contents: 1 fonts, 0 dirs
/usr/share/fonts/truetype/liberation: caching, new cache contents: 16 fonts, 0 dirs
/usr/share/fonts/truetype/nanum: caching, new cache contents: 10 fonts, 0 dirs
/usr/local/share/fonts: caching, new cache contents: 0 fonts, 0 dirs
/root/.local/share/fonts: skipping, no such directory
/root/.fonts: skipping, no such directory
/var/cache/fontconfig: cleaning cache directory
/root/.cache/fontconfig: not cleaning non-existent cache directory
/root/.fontconfig: not cleaning non-existent cache directory
fc-cache: succeeded


**데이터 불러오기**

In [91]:
df = pd.read_csv('https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/datasets/vgames2.csv')
df.tail()

       Unnamed: 0                         Name  ... JP_Sales  Other_Sales
16593       16594      Ice Age 2: The Meltdown  ...        0         0.01
16594       16595  Rainbow Islands: Revolution  ...        0            0
16595       16596                     NBA 2K16  ...     0.03         0.13
16596       16597  Toukiden: The Age of Demons  ...     0.25         0.03
16597       16598     The King of Fighters '95  ...     0.16         0.01

[5 rows x 10 columns]

# **2. 데이터 확인**

In [87]:
df.shape
#총 값은 16598개 행 10 열

(16598, 9)

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         16598 non-null  object
 1   Platform     16598 non-null  object
 2   Year         16327 non-null  float64
 3   Genre        16548 non-null  object
 4   Publisher    16540 non-null  object
 5   NA_Sales     16598 non-null  object
 6   EU_Sales     16598 non-null  object
 7   JP_Sales     16598 non-null  object
 8   Other_Sales  16598 non-null  object
dtypes: float64(1), object(8)
memory usage: 1.1+ MB

In [89]:
df.isnull().sum()

Name             0
Platform         0
Year           271
Genre           50
Publisher       58
NA_Sales         0
EU_Sales         0
JP_Sales         0
Other_Sales      0
dtype: int64

결측치 확인 결과 year : 271 개 / Genre : 50개 / Publisher  58개

In [90]:
print(df.describe())
"""
# 이상한점 1. sales는 나오지 않는다 - 문자가 포함되어 있음 그래서 문자를 없애 주어야함 
기본 단위는 M 
1. K를 M으로 없애고 M을 지운다. 

# 이상한점 2. Year에서 최솟값이 0 이고 평균이 1994 라는 이야기는 숫자가 잘못 설정 되었음을 말해준다. 
1. 결측치를 0으로 바꾼다. (NA)
2. 1~9 까지는 200을 앞에 붙인다. 
3. 10~50 이하는 2000년도로 바꾸고 
4. 50 이상은 1900년도로 바꾼다.
5. 0은 평균 값으로 변경한다.  

# 이상한점 3 Unnamed: 0 -  drop
# Publisher 결측값은 삭제 
"""

               Year
count  16327.000000
mean    1994.242543
std      155.077168
min        0.000000
25%     2003.000000
50%     2007.000000
75%     2010.000000
max     2020.000000

'\n# 이상한점 1. sales는 나오지 않는다 - 문자가 포함되어 있음 그래서 문자를 없애 주어야함 \n기본 단위는 M \n1. K를 M으로 없애고 M을 지운다. \n\n# 이상한점 2. Year에서 최솟값이 0 이고 평균이 1994 라는 이야기는 숫자가 잘못 설정 되었음을 말해준다. \n1. 결측치를 0으로 바꾼다. (NA)\n2. 1~9 까지는 200을 앞에 붙인다. \n3. 10~50 이하는 2000년도로 바꾸고 \n4. 50 이상은 1900년도로 바꾼다.\n5. 0은 평균 값으로 변경한다.  \n\n# 이상한점 3 Unnamed: 0 -  drop\n# Publisher 결측값은 삭제 \n'

# **3. 데이터 전처리**

#### **Unnamed: 0 탈락시키기**

In [ ]:
df.drop('Unnamed: 0', inplace=True, axis=1)
df1 = df

In [94]:
df1 = df

#### **K랑 M지우기**

In [121]:
subset1 = df1[['NA_Sales', 'EU_Sales', 'JP_Sales','Other_Sales']]
subset1 # 판매량 따로

      NA_Sales EU_Sales JP_Sales Other_Sales
0         0.04        0        0           0
1         0.17        0        0        0.01
2            0        0     0.02           0
3         0.04        0        0           0
4         0.12     0.09        0        0.04
...        ...      ...      ...         ...
16593     0.15     0.04        0        0.01
16594     0.01        0        0           0
16595     0.44     0.19     0.03        0.13
16596     0.05     0.05     0.25        0.03
16597        0        0     0.16        0.01

[16598 rows x 4 columns]

In [138]:
def fuction(x):
  if 'M' in x :
    return (float(x.replace('M','')))
  elif 'K' in x :
    return (float(x.replace('K','')))*0.001
  else :
    return float(x)

In [ ]:
subset_NA_Sales= subset1["NA_Sales"].apply(lambda x : fuction(x))
subset_EU_Sales= subset1["EU_Sales"].apply(lambda x : fuction(x))
subset_JP_Sales= subset1["JP_Sales"].apply(lambda x : fuction(x))
subset_Other_Sales= subset1["Other_Sales"].apply(lambda x : fuction(x))

In [149]:
new_subset = pd.concat([subset_NA_Sales, subset_EU_Sales, subset_JP_Sales, subset_Other_Sales], axis=1)
new_subset.info()
#new_subset = k와 m 이 정리된 sub data set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   NA_Sales     16598 non-null  float64
 1   EU_Sales     16598 non-null  float64
 2   JP_Sales     16598 non-null  float64
 3   Other_Sales  16598 non-null  float64
dtypes: float64(4)
memory usage: 518.8 KB

In [157]:
df2 = df1.drop(['NA_Sales','EU_Sales', 'JP_Sales','Other_Sales'], axis = 1)
df2
# 기존에 있던 열 지우기

                                                 Name  ...                    Publisher
0                        Candace Kane's Candy Factory  ...                    Destineer
1                                      The Munchables  ...           Namco Bandai Games
2      Otome wa Oanesama Boku ni Koi Shiteru Portable  ...                    Alchemist
3                    Deal or No Deal: Special Edition  ...                    Zoo Games
4           Ben 10 Ultimate Alien: Cosmic Destruction  ...                  D3Publisher
...                                               ...  ...                          ...
16593                         Ice Age 2: The Meltdown  ...                Vivendi Games
16594                     Rainbow Islands: Revolution  ...            Rising Star Games
16595                                        NBA 2K16  ...         Take-Two Interactive
16596                     Toukiden: The Age of Demons  ...                   Tecmo Koei
16597                        The King of Fighters '95  ...  Sony Computer Entertainment

[16598 rows x 5 columns]

In [160]:
new_df = pd.concat([df2, new_subset], axis=1)
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         16598 non-null  object
 1   Platform     16598 non-null  object
 2   Year         16327 non-null  float64
 3   Genre        16548 non-null  object
 4   Publisher    16540 non-null  object
 5   NA_Sales     16598 non-null  float64
 6   EU_Sales     16598 non-null  float64
 7   JP_Sales     16598 non-null  float64
 8   Other_Sales  16598 non-null  float64
dtypes: float64(5), object(4)
memory usage: 1.1+ MB

####**판매량 총합 추가**

In [161]:
#열추가 
#판매량 총합 추가 
new_df["overall_sales"] = (new_df['NA_Sales'] + new_df['EU_Sales'] + new_df['JP_Sales'] + new_df['Other_Sales']).round(2)
new_df.head()

                                             Name  ... overall_sales
0                    Candace Kane's Candy Factory  ...          0.04
1                                  The Munchables  ...          0.18
2  Otome wa Oanesama Boku ni Koi Shiteru Portable  ...          0.02
3                Deal or No Deal: Special Edition  ...          0.04
4       Ben 10 Ultimate Alien: Cosmic Destruction  ...          0.25

[5 rows x 10 columns]

In [163]:
sort_overall_new_df1 = new_df.sort_values(['overall_sales'], ascending=False)
sort_overall_new_df1.head()

                           Name Platform  ...  Other_Sales overall_sales
2908                 Wii Sports      Wii  ...         8.46         82.74
4199          Super Mario Bros.      NES  ...         0.77         40.24
12579            Mario Kart Wii      Wii  ...         3.31         35.83
3352          Wii Sports Resort      Wii  ...         2.96         33.00
7829   Pokemon Red/Pokemon Blue       GB  ...         1.00         31.38

[5 rows x 10 columns]

In [ ]:
#총합의 상위 50개를 살펴 본 결과 년도에 NAN값이 나타나지 않는다 . 
#NAN값을 처리하는 것이 그렇게 중요하지 않은듯 하다.
#Nan값을 과감하게 지우자.

In [164]:
sort_overall_new_df1.dropna()

                                                    Name  ... overall_sales
2908                                          Wii Sports  ...         82.74
4199                                   Super Mario Bros.  ...         40.24
12579                                     Mario Kart Wii  ...         35.83
3352                                   Wii Sports Resort  ...         33.00
7829                            Pokemon Red/Pokemon Blue  ...         31.38
...                                                  ...  ...           ...
14265         Nitroplus Blasterz: Heroines Infinite Duel  ...          0.01
2311   Shinseiki Evangelion: Koutetsu no Girlfriend 2...  ...          0.01
11376                                     Rail Simulator  ...          0.01
3571                         Hyperdimension Neptunia mk2  ...          0.01
5598    SCORE International Baja 1000: The Official Game  ...          0.00

[16241 rows x 10 columns]

In [166]:
sort_overall_new_df1.describe()

               Year      NA_Sales  ...   Other_Sales  overall_sales
count  16327.000000  16598.000000  ...  16598.000000   16598.000000
mean    1994.242543      0.264667  ...      0.048063       0.537164
std      155.077168      0.816683  ...      0.188588       1.555151
min        0.000000      0.000000  ...      0.000000       0.000000
25%     2003.000000      0.000000  ...      0.000000       0.060000
50%     2007.000000      0.080000  ...      0.010000       0.170000
75%     2010.000000      0.240000  ...      0.040000       0.470000
max     2020.000000     41.490000  ...     10.570000      82.740000

[8 rows x 6 columns]

# **Year값** 수정하기

In [169]:
sort_overall_new_df1.head()

                           Name Platform  ...  Other_Sales overall_sales
2908                 Wii Sports      Wii  ...         8.46         82.74
4199          Super Mario Bros.      NES  ...         0.77         40.24
12579            Mario Kart Wii      Wii  ...         3.31         35.83
3352          Wii Sports Resort      Wii  ...         2.96         33.00
7829   Pokemon Red/Pokemon Blue       GB  ...         1.00         31.38

[5 rows x 10 columns]


**이상한점** 

Year에서 최솟값이 0 이고 평균이 1994 라는 이야기는 숫자가 잘못 설정 되었음을 말해준다. 
1. 50 미만은 2000년도로 바꾸고  ( + 2000)
2. 50 이상은 1900년도로 바꾼다. (+ 1900)

In [ ]:
def func (x):
    if x < 30 :
        return x + 2000
    elif x >= 30 and x < 100 :
        return x + 1900
    else:
        return

In [ ]:
df2 = df1['Year'].apply(func)
df2

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
         ..
16593   NaN
16594   NaN
16595   NaN
16596   NaN
16597   NaN
Name: Year, Length: 16598, dtype: float64

In [ ]:
df1.describe()

               Year      NA_Sales      EU_Sales      JP_Sales   Other_Sales
count  16327.000000  16398.000000  16398.000000  16399.000000  16398.000000
mean    1994.242543      0.262936      0.146316      0.077508      0.048191
std      155.077168      0.812562      0.506024      0.308086      0.189502
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%     2003.000000      0.000000      0.000000      0.000000      0.000000
50%     2007.000000      0.080000      0.020000      0.000000      0.010000
75%     2010.000000      0.240000      0.110000      0.040000      0.040000
max     2020.000000     41.490000     29.020000     10.220000     10.570000

# Nan값 있는 열 지우기